Repository: alexsosat/flutter_common_classes
Catalog: assets/l10n/intl_*.arb
Languages: de, es, fr, ko, pt

# cacheExceptionTitle
source: Error accessing information on the device
de: Fehler beim Zugriff auf Informationen auf dem Gerät
es: Error al acceder a información en el dispositivo
fr: Erreur d'accès aux informations sur l'appareil
ko: 장치의 정보에 액세스하는 동안 오류가 발생했습니다.
pt: Erro ao aceder a informações no dispositivo

# certificateInvalidMessage
source: The server's security certificate is invalid
de: Das Sicherheitszertifikat des Servers ist ungültig
es: El certificado de seguridad del servidor no es válido
fr: Le certificat de sécurité du serveur n'est pas valide
ko: 서버의 보안 인증서가 유효하지 않습니다.
pt: O certificado de segurança do servidor é inválido

# certificateInvalidTitle
source: Invalid certificate
de: Ungültiges Zertifikat
es: Certificado no válido
fr: Certificat invalide
ko: 잘못된 인증서
pt: Certificado inválido

# deleteValueError
source: An error occurred when deleting the value of {token}
de: Beim Löschen des Wertes von {token} ist ein Fehler aufgetreten
es: Ocurrió un error al eliminar el valor de {token}
fr: Une erreur s'est produite lors de la suppression de la valeur de {token}
ko: {token} 값을 삭제할 때 오류가 발생했습니다.
pt: Ocorreu um erro ao eliminar o valor de {token}

# environmentExceptionMessage
source: An error occurred while loading the app configuration: {token}
de: Beim Laden der App-Konfiguration ist ein Fehler aufgetreten: {token}
es: Ocurrió un error al cargar la configuración de la app: {token}
fr: Une erreur s'est produite lors du chargement de la configuration de l'application : {token}
ko: 앱 구성을 로드하는 동안 오류가 발생했습니다: {token}
pt: Ocorreu um erro ao carregar a configuração da aplicação: {token}

# environmentExceptionTitle
source: Environment error
de: Fehler in der Umgebung
es: Error de ambiente
fr: Erreur d'environnement
ko: 환경 오류
pt: Erro de ambiente

# formInvalidFailureTitle
source: Invalid form
de: Ungültiges Formular
es: Formulario inválido
fr: Formulaire non valide
ko: 잘못된 양식
pt: Formulário inválido

# internetConnectionUnavailableMessage
source: Check your internet connection and try again.
de: Überprüfen Sie Ihre Internetverbindung und versuchen Sie es erneut.
es: Revisa tu conexión a internet y vuelve a intentarlo
fr: Vérifiez votre connexion internet et réessayez.
ko: 인터넷 연결을 확인하고 다시 시도하세요.
pt: Verifique a sua ligação à Internet e tente novamente.

# internetConnectionUnavailableTitle
source: No internet connection
de: Keine Internetverbindung
es: Sin conexión a internet
fr: Pas de connexion internet
ko: 인터넷 연결 없음
pt: Sem ligação à Internet

# readValueError
source: An error occurred when reading the value of {token}
de: Beim Lesen des Wertes von {token} ist ein Fehler aufgetreten
es: Ocurrió un error al leer el valor de {token}
fr: Une erreur s'est produite lors de la lecture de la valeur de {token}
ko: {token} 값을 읽을 때 오류가 발생했습니다.
pt: Ocorreu um erro ao ler o valor de {token}

# requestBadMessage
source: Parameters sent to the server are incorrect
de: Die an den Server gesendeten Parameter sind falsch
es: Los parámetros enviados al servidor son incorrectos
fr: Les paramètres envoyés au serveur sont incorrects
ko: 서버로 전송된 매개변수가 올바르지 않습니다.
pt: Os parâmetros enviados para o servidor estão incorrectos

# requestBadTitle
source: Incorrect request
de: Falscher Antrag
es: Petición incorrecta
fr: Demande incorrecte
ko: 잘못된 요청
pt: Pedido incorreto

# requestCanceledMessage
source: The request was cancelled by the user
de: Die Anfrage wurde vom Benutzer abgebrochen
es: La petición fue cancelada por el usuario
fr: La demande a été annulée par l'utilisateur
ko: 사용자가 요청을 취소했습니다.
pt: O pedido foi cancelado pelo utilizador

# requestCanceledTitle
source: Request cancelled
de: Petition annulliert
es: Petición cancelada
fr: Pétition annulée
ko: 청원 취소됨
pt: Petição anulada

# saveValueError
source: An error occurred while saving the value: {token}
de: Beim Speichern des Wertes ist ein Fehler aufgetreten: {token}
es: Ocurrió un error al guardar el valor: {token}
fr: Une erreur s'est produite lors de l'enregistrement de la valeur : {token}
ko: 값을 저장하는 동안 오류가 발생했습니다: {token}
pt: Ocorreu um erro ao guardar o valor: {token}

# serverUnderMantainanceTitle
source: Our servers are under maintenance
de: Unsere Server werden gerade gewartet
es: Nuestros servidores se encuentran en mantenimiento
fr: Nos serveurs sont en cours de maintenance
ko: 서버가 점검 중입니다.
pt: Os nossos servidores estão em manutenção

# sessionExpiredMessage
source: Your session has expired, please log in again.
de: Ihre Sitzung ist abgelaufen, bitte melden Sie sich erneut an.
es: La sesión ha expirado, por favor inicie sesión de nuevo
fr: Votre session a expiré, veuillez vous connecter à nouveau.
ko: 세션이 만료되었습니다. 다시 로그인하세요.
pt: A sua sessão expirou, por favor inicie sessão novamente.

# sessionExpiredTitle
source: Session expired
de: Sitzung abgelaufen
es: Sesión caducada
fr: Session expirée
ko: 세션이 만료되었습니다.
pt: Sessão expirada

# tryAgainLater
source: Please try again later
de: Bitte versuchen Sie es später noch einmal
es: Por favor intenta más tarde
fr: Veuillez réessayer plus tard
ko: 나중에 다시 시도하세요.
pt: Por favor, tente novamente mais tarde

# userUnauthorizedMessage
source: The user does not have the necessary permissions to access this screen.
de: Der Benutzer verfügt nicht über die erforderlichen Berechtigungen für den Zugriff auf diesen Bildschirm.
es: El usuario no tiene los permisos necesarios para acceder a esta pantalla
fr: L'utilisateur ne dispose pas des autorisations nécessaires pour accéder à cet écran.
ko: 사용자에게 이 화면에 액세스할 수 있는 필수 권한이 없습니다.
pt: O utilizador não tem as permissões necessárias para aceder a este ecrã.

# userUnauthorizedTitle
source: This user does not have access to the screen
de: Dieser Benutzer hat keinen Zugriff auf den Bildschirm
es: Este usuario no tiene acceso a la pantalla
fr: Cet utilisateur n'a pas accès à l'écran
ko: 이 사용자에게는 화면에 액세스할 수 있는 권한이 없습니다.
pt: Este utilizador não tem acesso ao ecrã
